const occasion = [
  {
    id: "clarification",
    text: `Зміна площі відбулася в результаті перерахунку площ приміщень після уточнення лінійних розмірів. Згідно з Постановою КМУ від 12 травня 2023 р. № 488 "Деякі питання проведення технічної інвентаризації", п. 72. Під час розрахунків слід користуватися величинами, визначеними у процесі безпосередніх обмірів. Обчислення площ слід виконувати з точністю до одного десяткового знака після коми. п. 75. Площа приміщень визначається за їх розмірами, вимірюваними між опорядженими поверхнями стін і перегородок на рівні 1,10 м - 1,30 м від підлоги.`,
  },

  {
    id: "glazing",
    text: `Зміна площі відбулась за рахунок зміни коефіцієнту підрахунку площі після засклення ЛОДЖІЇ / БАЛКОНУ. Згідно з Постановою КМУ від 12 травня 2023 р. № 488 "Деякі питання проведення технічної інвентаризації", п. 88. Загальну площу квартир визначають як суму площ усіх приміщень квартири, вбудованих шаф і балконів, терас, лоджій, розрахованих із знижувальними коефіцієнтами, визначеними у пункті 73 цього Порядку. п. 73. Загальна площа поверхів будівель повинна включати площі балконів, терас, лоджій, веранд із знижувальними коефіцієнтами: 
для балконів і терас — 0,3; 
для лоджій — 0,5; 
для засклених балконів — 0,8; 
для лоджій і веранд — 1.`,
  },
  {
    id: "clarification_glazing_2",
    text: `Зміна площі відбулась за рахунок зміни коефіцієнту підрахунку площі після засклення ЛОДЖІЇ / БАЛКОНУ, а також уточнення лінійних розмірів. Згідно з Постановою КМУ від 12 травня 2023 р. № 488 "Деякі питання проведення технічної інвентаризації", п. 72. Під час розрахунків слід користуватися величинами, визначеними у процесі безпосередніх обмірів. Обчислення площ слід виконувати з точністю до одного десяткового знака після коми. п. 75. Площа приміщень визначається за їх розмірами, вимірюваними між опорядженими поверхнями стін і перегородок на рівні 1,10 м - 1,30 м від підлоги. п. 88. Загальну площу квартир визначають як суму площ усіх приміщень квартири, вбудованих шаф і балконів, терас, лоджій, розрахованих із знижувальними коефіцієнтами, визначеними у пункті 73 цього Порядку. п. 73. Загальна площа поверхів будівель повинна включати площі балконів, терас, лоджій, веранд із знижувальними коефіцієнтами: 
для балконів і терас — 0,3; 
для лоджій — 0,5; 
для засклених балконів — 0,8; 
для лоджій і веранд — 1.`,
  },

  {
    id: "postanova406",
    text: `Зміна загальної площі відбулася за рахунок демонтування перегородок. Згідно з Постановою КМУ від 7 червня 2017 р. № 406 "Про затвердження переліку будівельних робіт, які не потребують документів, що дають право на їх виконання, та після закінчення яких об’єкт не підлягає прийняттю в експлуатацію",  п. 1 "Роботи з переобладнання та перепланування жилого будинку і жилого приміщення, а також нежилого будинку, будівлі, споруди, приміщення в них, виконання яких не передбачає втручання в огороджувальні та несучі конструкції та/або інженерні системи загального користування, - щодо об’єктів, що за класом наслідків (відповідальності) належать до об’єктів з незначними (СС1), з середніми (СС2) та значними (СС3) наслідками."`,
  },
  {
    id: "without_balkon_1",
    text: `Зміна площ відбулась за рахунок виключення площі ЛОДЖІЇ / БАЛКОНУ / ТЕРАСИ з загальної площі будинку. Згідно з Постановою КМУ від 12 травня 2023 р. № 488 "Деякі питання проведення технічної інвентаризації", п. 97. Загальна площа житлового будинку садибного типу, дачного та садового будинків визначається як сума площ усіх приміщень без урахування площ балконів, лоджій, терас, прибудованих альтанок (відкритих веранд), технічних підпіль, горищ. До загальної площі таких будинків включаються площі приміщень усіх поверхів, враховуючи мансардний, цокольний і підвальний. Площа горища, технічного поверху або підвалу  заввишки 1,9 метра і менше, а також портиків, ґанків, зовнішніх відкритих сходів та пандусів, відкритих та критих терас до загальної площі будинку не включається.`,
  },
  {
    id: "without_balkon_2",
    text: `Виявлено, що при оформленні права власності не враховано 30% / 80% ПЛОЩІ БАЛКОНУ, 50% / 100% ЛОДЖІЇ, 100% ХОЛОДНОЇ КОМОРИ, 100% ВЕРАНДИ. Згідно з Постановою КМУ від 12 травня 2023 р. № 488 "Деякі питання проведення технічної інвентаризації", п.88. Загальну площу квартир визначають як суму площ усіх приміщень квартири, вбудованих шаф і балконів, терас, лоджій, розрахованих із знижувальними коефіцієнтами, визначеними у пункті 73 цього Порядку. п. 73. Загальна площа поверхів будівель повинна включати площі балконів, терас, лоджій, веранд із знижувальними коефіцієнтами: для балконів і терас — 0,3; для лоджій — 0,5; для засклених балконів — 0,8; для лоджій і веранд — 1.`,
  },
  {
    id: "zmina_za_rahunok_vkluchennya_zabudovi",
    text: `Зміна площ відбулась за рахунок того, що при оформленні ПРАВОГО ДОКУМЕНТУ до загальної площі внесено площу забудови.`,
  },
  {
    id: "pereliteraciya_budivel",
    text: `Згідно з даними ПРАВОВОГО, від 00.00.0000 р., літерація будівель та споруд складає:

- житловий будинок, літ. «А1»
- веранда, літ. «а»
- веранда, літ. «а1»

Згідно з даними технічної інвентаризації 00 вересня 2023 р. літерація будинку операторів та господарських будівель розташованих за адресою: АДРЕСА, складає: 

- житловий будинок, літ. «А-1»
- веранда, літ. «а1-1»
- веранда, літ. «а2-1»
 
Згідно з Постановою КМУ від 12 травня 2023 р. № 488 "Деякі питання проведення технічної інвентаризації", п. 46. Кожен житловий будинок, будівля, господарські (присадибні) будівлі та споруди, окремо розташовані захисні споруди (споруди подвійного призначення), починаючи з основної, літеруються великими літерами українського алфавіту. п. 48. У разі літерування великої кількості житлових будинків, будівель та господарських (присадибних) та інших допоміжних будівель, розміщених на одній земельній ділянці, якщо закінчуються літери алфавіту, ліворуч зазначають додаткові цифрові позначення. Наприклад, 2А; 2Б; 2В; 3А; 3Б тощо. Наприклад, А1, А2 — основна частина та прибудова до житлового будинку; “а3”, “а4”, “а5”, “а6” — тамбури, веранди тощо; “В”, “Г” — господарські (присадибні) будівлі (сарай, гараж, літня кухня тощо); № 1, № 2 — господарські (присадибні) споруди (огорожі, хвіртки, ворота тощо); I, II — замощення, вимощення, машино-місця. Поверховість житлового будинку, будівлі або їх окремих частин додатково зазначається через тире. Наприклад, А — 1, Б — 2; 2В — 4 тощо.
`,
  },
  {
    id: "do_desyatkovogo",
    text: `Зміна площі відбулася в результаті перерахунку площ приміщень після уточнення лінійних розмірів. Згідно з Постановою КМУ від 12 травня 2023 р. № 488 "Деякі питання проведення технічної інвентаризації", п. 72. Під час розрахунків слід користуватися величинами, визначеними у процесі безпосередніх обмірів. Обчислення площ слід виконувати з точністю до одного десяткового знака після коми.`,
  },
  {
    id: "plosha_shodiv",
    text: `Зміна площ відбулась за рахунок виключення ПЛОЩІ, ЗАЙНЯТОЇ СХОДАМИ, на другому поверсі, з загальної площі будинку. Згідно з Постановою КМУ від 12 травня 2023 р. № 488 "Деякі питання проведення технічної інвентаризації", п. 89. Площа, зайнята сходами у багаторівневій квартирі, житловому будинку садибного типу, садовому або дачному будинку на першому рівні, не виключається з площі приміщень, у яких вони розташовані. Площа прорізів сходів (у межах отвору) на наступних рівнях до площі приміщень, у яких вони розташовані, не зараховується.`,
  },
  {
    id: "plosha_litnih_gromadska_bud",
    text: `Зміна площ відбулась за рахунок включення площі ПІДВАЛУ / ЛОДЖІЇ / БАЛКОНУ / ТЕРАСИ до загальної площі будинку. Згідно з Постановою КМУ від 12 травня 2023 р. № 488 "Деякі питання проведення технічної інвентаризації", п. 99. Загальна площа громадської будівлі визначається як сума площ усіх поверхів (включаючи технічні, мансардний, цокольний та підвальні).  Корисна площа громадського будинку визначається як сума площ усіх розташованих у ньому приміщень, а також балконів і антресолей у залах, фойє тощо, крім сходових кліток, ліфтових шахт, внутрішніх відкритих сходів і пандусів. п. 100. Площу поверхів будинків визначають як суму площ усіх приміщень, розташованих на поверсі, а також площ балконів, терас, лоджій із знижувальними коефіцієнтами, визначеними відповідно до пункту 73 цього Порядку. Площу антресолей, переходів до інших будинків, засклених веранд, галерей та балконів залів для глядачів та інших залів слід включати до загальної площі будинку. Площу багатосвітлових приміщень слід включати до загальної площі будинку в межах тільки одного (нижнього для цих приміщень) поверху. Загальна площа приміщень у громадських будівлях і спорудах, а також у приміщеннях громадського призначення, вбудованих чи вбудовано-прибудованих до житлових будинків або будівель іншого призначення, включає площі балконів, терас, лоджій, веранд із знижувальними коефіцієнтами, визначеними відповідно до пункту 73 цього Порядку. п. 73. Загальна площа поверхів будівель повинна включати площі балконів, терас, лоджій, веранд із знижувальними коефіцієнтами: для балконів і терас — 0,3; для лоджій — 0,5; для засклених балконів — 0,8; для лоджій і веранд — 1.`,
  },
  {
    id: "plosha_litnih_virobnicha_bud",
    text: `Зміна площ відбулась за рахунок включення площі ПІДВАЛУ / ЛОДЖІЇ / БАЛКОНУ / ТЕРАСИ до загальної площі будинку. Згідно з Постановою КМУ від 12 травня 2023 р. № 488 "Деякі питання проведення технічної інвентаризації", п. 101. Загальна площа виробничої будівлі визначається як сума площ усіх поверхів (надземних (зокрема технічних), цокольного і підвальних). Площу поверхів виробничих будівель визначають як суму площ усіх приміщень, розташованих на поверсі, тунелів, внутрішніх майданчиків, антресолей, всіх ярусів галерей і переходів в інші будівлі, а також площ балконів, терас, лоджій, розрахованих із знижувальними коефіцієнтами, визначеними відповідно до пункту 73 цього Порядку. У разі коли принаймні одна зовнішня огороджувальна конструкція приміщення представлена колонами, площа такого приміщення  розраховується від зовнішнього контуру колон до внутрішніх поверхонь стін (зовнішнього контуру колон — у разі відсутності стін). п. 73. Загальна площа поверхів будівель повинна включати площі балконів, терас, лоджій, веранд із знижувальними коефіцієнтами: для балконів і терас — 0,3; для лоджій — 0,5; для засклених балконів — 0,8; для лоджій і веранд — 1.`,
  },
  {
    id: "plosha_mensha_1_90",
    text: `Зміна площ відбулась в результаті виключення площі приміщень висотою до 1,9 м із загальної площі будинку. Згідно з Постановою КМУ від 12 травня 2023 р. № 488 "Деякі питання проведення технічної інвентаризації", п. 102. До загальної площі будівлі не включаються площі технічного поверху заввишки менше 1,9 метра до низу виступаючих конструкцій, над підвісними стелями, що проектуються з додатковими горизонтальними огороджувальними конструкціями для розміщення в просторі над ними інженерного обладнання та комунікацій, а також майданчиків для обслуговування підкранових колій, кранів, конвеєрів, монорейок і світильників.`,
  },
  {
    id: "do_1992",
    text: `Згідно до постанови Кабінету Міністрів України від 25 грудня 2015 р. № 1127, в редакції від 23 серпня 2016 р. № 553 "Порядок державної реєстрації речових прав на нерухоме майно та їх обтяжень" та листа Міністерства юстиції від 23.02.2016 №8.4-35//18/1, від 23.02.2016 №8.4-35//18/1 "Щодо державної реєстрації права власності на об’єкти нерухомого майна, збудованих до 5 серпня 1992 року", такі об'єкти не підлягають прийняттю в експлуатацію.`,
  },
  {
    id: "vykliuchennia_ploshchi_v_mezhakh_otvoriv_dverei",
    text: `Зміна площі відбулася в результаті виключення площі в межах отворів дверей. Згідно з Постановою КМУ від 12 травня 2023 р. № 488 "Деякі питання проведення технічної інвентаризації" п. 80. Площа підлоги між приміщеннями житлового будинку, будівлі в межах отворів дверей (незалежно від наявності під час обмірів та товщини стіни) не зараховується. Площу підлоги між приміщеннями в межах арок (отворів без дверей) зараховують до загальної площі приміщення, якщо отвір завширшки не менш як 0,7 метра і заввишки не менш як 1,9 метра від рівня підлоги. При цьому площа підлоги, розташованої в межах арок, між житловими приміщеннями розподіляється між ними порівну, між житловими приміщеннями і допоміжними приміщеннями зараховується до підсобної площі, а в громадських та виробничих будівлях площа між основними та допоміжними приміщеннями - до допоміжних.`,
  },
  {
    id: "vykliuchennia_dopomizhnykh_prymishchen_z_zhytlovoi_ploshchi",
    text: `Зміна житлової площі відбулася в результаті виключення площі кухні-їдальні з житлової площі будинку. Згідно з Постановою КМУ від 12 травня 2023 р. № 488 "Деякі питання проведення технічної інвентаризації", п. 95. Вітальні, їдальні, бібліотеки, дитячі ігрові кімнати, більярдні, тренажерні, молебні кімнати, кабінети тощо належать до категорії житлових приміщень (житлової площі). До допоміжних приміщень житлових будинків (квартир) належать передпокій, кухня-їдальня, хол, зимовий сад, пральня, гардеробна та інші приміщення допоміжного призначення, які належать до допоміжної площі.`,
  },
  {
    id: "dodatkova_primitka",
    text: `Зміни що відносяться до категорії самочинних та потребують дозвільної документації для введення в експлуатацію не виявлено.`,
  },
];

const items = [
  {
    key: "clarification",
    value: "Уточнення лінійних розмірів",
    description: "",
  },
  { key: "glazing", value: "Засклення балкону/лоджії", description: "" },
  { key: "postanova406", value: "Постанова 406", description: "" },
  {
    key: "without_balkon_1",
    value: "Не враховано площу літніх приміщень 1",
    description: "",
  },
  {
    key: "without_balkon_2",
    value: "Не враховано площу літніх приміщень 2",
    description: "",
  },
  {
    key: "zmina_za_rahunok_vkluchennya_zabudovi",
    value: "Включення площі забудови до загальної площі",
    description: "",
  },
  {
    key: "pereliteraciya_budivel",
    value: "Перелітерація будівель",
    description: "",
  },
  {
    key: "do_desyatkovogo",
    value: "Округлення до десяткового знаку",
    description: "",
  },
  { key: "plosha_shodiv", value: "Виключення площі сходів", description: "" },
  {
    key: "plosha_litnih_gromadska_bud",
    value: "Включення площі літніх прим. гром. буд.",
    description: "",
  },
  {
    key: "plosha_litnih_virobnicha_bud",
    value: "Включення площі літніх прим. вироб. буд.",
    description: "",
  },
  {
    key: "plosha_mensha_1_90",
    value: "Виключення площ висотою менше 1.90м",
    description: "",
  },
  { key: "do_1992", value: "Амністія до 1992", description: "" },
  {
    key: "vykliuchennia_dopomizhnykh_prymishchen_z_zhytlovoi_ploshchi",
    value: "Виключення допоміжних приміщень зжитлової площі",
    description: "",
  },
  {
    key: "vykliuchennia_ploshchi_v_mezhakh_otvoriv_dverei",
    value: "Виключення площі в межах отворів дверей",
    description: "",
  },
  { key: "dodatkova_primitka", value: "Додаткова примітка", description: "" },
];

const textarea = document.getElementById("textarea");
const additionalNoteSwitch = document.getElementById("additionalNote");
const state = { condition: [], textarea: [] };

// Tail select
document.addEventListener("DOMContentLoaded", function () {
  tail
    .select("#select", {
      search: true,
      width: "100%",
      locale: "ru",
      items,
    })
    .on("change", (e) => {
      occasion.forEach((item) => {
        if (e.key === item.id) {
          textarea.value = item.text;
        }
      });

      // tail.select("#select").reload();
    });

  // Load first text area
  const select = document.getElementById("select");
  occasion.forEach((item) => {
    if (select.value === item.id) {
      textarea.value = item.text;
    }
    if (select.value === item.id && additionalNoteSwitch.checked) {
      let dodatkova_primitka =
        " " +
        occasion.filter((item) => item.id === "dodatkova_primitka")[0].text;
      textarea.value = item.text;
      textarea.value += dodatkova_primitka;
    }
  });
});

additionalNoteSwitch.addEventListener("change", (e) => {
  let dodatkova_primitka =
    " " + occasion.filter((item) => item.id === "dodatkova_primitka")[0].text;
  if (e.target.checked) {
    textarea.value += dodatkova_primitka;
  } else {
    textarea.value = textarea.value.replace(dodatkova_primitka, "");
  }
});

// (function handleSwitch() {
//     switches.forEach(el => {
//         state.condition.push({ id: el.id, status: el.hasAttribute('checked') });
//     });
// }());

// // Change event for switches
// switches.forEach(el => {

//     el.addEventListener('change', (e) => {
//         let id = e.target.id;
//         let find = state.condition.filter(el => el.id === id);
//         let status = find.length > 0 ? find[0].status : [];

//         if (status === false) {
//             find[0].status = true;
//             e.target.setAttribute('checked', '');
//             state.textarea.push(id);
//             handleTextAreaValue(state.textarea);
//         }
//         if (status === true) {
//             find[0].status = false;
//             state.textarea.splice(id, 1);
//             handleTextAreaValue(state.textarea);
//         }
//     });

// });

// function removeSwitches(switches) {
//     switches.forEach(el => {
//         el.removeAttribute('checked');
//     })
// }

// function handleTextAreaValue(arr) {
//     if (arr.filter(el => el === 'clarification').length === 1) {
//         textarea.value = occasion['clarification'];
//     }
//     if (arr.filter(el => el === 'glazing').length === 1) {
//         textarea.value = occasion['glazing'];
//     }
//     if (arr.filter(el => el === 'postanova406').length === 1) {
//         removeSwitches(switches);
//         textarea.value = occasion['postanova406'];
//     }
//     if (arr.filter(el => el === 'clarification').length === 1
//         && arr.filter(el => el === 'glazing').length === 1) {
//         textarea.value = occasion['clarification_glazing'];
//     }
//     if (arr.length === 0) {
//         textarea.value = '';
//         state.textarea = [];
//     }
// }

// Initialize toast
const toast = document.getElementById("toast");
function toastConstructor(toast, params) {
  toast.innerHTML = "";
  toast.classList = "";
  if (params.text === undefined) {
    params.text = "";
  } else {
    const body = document.createElement("div");
    if (params.type === "success") {
      toast.classList = "toast bg-success text-light";
      body.classList = "toast-body";
      body.innerText = params.text;
    } else if (params.type === "error") {
      toast.classList = "toast bg-danger text-light";
      body.classList = "toast-body";
      body.innerText = params.text;
    } else {
      toast.classList = "toast bg-primary text-light";
      body.classList = "toast-body";
      body.innerText = params.text;
    }
    toast.appendChild(body);
  }
}

const btn = document.getElementById("btn");
if (btn) {
  document.getElementById("btn").addEventListener("click", () => {
    textarea.select();
    document.execCommand("copy");
    textarea.blur();

    toastConstructor(toast, { type: "success", text: "Зкопійовано!!!" }); // Setup toast
    new bootstrap.Toast(toast).show(); // Show toast
  });
}

// Mask for telephone input
const inputDzkNomer = document.getElementById("dzk-number");

const inputMask = new Inputmask("9999999999:99:999:9999");
inputMask.mask(inputDzkNomer);

const buttonDzkNumber = document.getElementById("button-dzk-number");
buttonDzkNumber.addEventListener("click", async () => {
  if (inputDzkNomer.value.length === 22) {
    // window.open(`https://kadastr.live/parcel/${inputDzkNomer.value}`);
    const response = await fetch(
      `https://kadastr.live/search/${inputDzkNomer.value}`
    );

    if (response.status === 200) {
      const dataGet = await response.json();

      // If results nothing exit
      if (dataGet.results.length === 0) {
        toastConstructor(toast, {
          type: "error",
          text: "Інформацію, яку Ви шукали, не знайдено. Перевірте правильність введених даних",
        }); // Setup toast
        return new bootstrap.Toast(toast).show(); // Show toast
      }

      console.log(dataGet);

      const area = dataGet.results[0].area;
      const unit_area = dataGet.results[0].unit_area;
      const purpose = dataGet.results[0].purpose;
      const use = dataGet.results[0].use;
      const address = dataGet.results[0].address;
      const location = dataGet.results[0].location;
      const x = location[0];
      const y = location[1];

      const vivod = `
      <div class="text-light">Координати: <code class="code-copy">${y}, ${x}</code></div>
      <div class="text-light">Адреса: <code class="code-copy">${address}</code></div>
      <div class="text-light">Цільове призначення: <code class="code-copy">${purpose}</code></div>
      <div class="text-light">Використання: <code class="code-copy">${use}</code></div>
      <div class="text-light">Площа: <code class="code-copy">${area} ${unit_area}</code></div>
      <a href="https://maps.visicom.ua/c/${x},${y},18/m/lang=uk" target="_blank">Пошук у візікомі →</a>
      <a href="https://kadastr.live/parcel/${inputDzkNomer.value}" target="_blank">Пошук в кадастр лайв →</a>
      <a href="https://www.google.com.ua/maps?q=${y},${x}" target="_blank">Пошук в гугл мепс →</a>
      <a href="https://www.bing.com/maps?q=${y},${x}&lvl=16.0&style=h" target="_blank" class="pb-5">Пошук в бинг мепс →</a>
      `;

      // console.log(vivod);
      document.getElementById("dzk-answer").innerHTML = vivod;

      // Update visicom map
//       let visicomMapSrc = `https://maps.visicom.ua/iframe/uk/${visicomMapSizes.width}:500/?c/${x}:${y}:15/m0/${x}:${y}/`;

//       visicomMap.width = visicomMapSizes.width;
//       visicomMap.height = 500;
//       visicomMap.src = visicomMapSrc;

      // Add listener for text copy
      document.querySelectorAll(".code-copy").forEach((item) => {
        item.addEventListener("click", async (e) => {
          await navigator.clipboard.writeText(e.target.innerText);
          toastConstructor(toast, {
            type: "success",
            text: `"${e.target.innerText}" зкопійовано!!!`,
          }); // Setup toast
          new bootstrap.Toast(toast).show(); // Show toast
        });
      });
    } else {
      toastConstructor(toast, {
        type: "error",
        text: "Інформацію, яку Ви шукали, не знайдено. Перевірте правильність введених даних",
      }); // Setup toast
      new bootstrap.Toast(toast).show(); // Show toast
    }
  } else {
    toastConstructor(toast, {
      type: "error",
      text: "Введіть кадастровий номер!",
    }); // Setup toast
    new bootstrap.Toast(toast).show(); // Show toast
  }
});

// Visicom map
// const visicomMap = document.getElementById("visicomMap");
// const visicomMapSizes = {
//   width: "",
//   height: ""
// }
// function outputsize() {
//   visicomMapSizes.width = document.getElementById("wrapper").clientWidth - 24;
//   visicomMapSizes.height = document.getElementById("wrapper").clientHeight;

//   let visicomMapSrc = `https://maps.visicom.ua/iframe/uk/${visicomMapSizes.width}:500/?c/30.52229:50.44753:15/m0/30.52206:50.44774/`;

//   visicomMap.width = visicomMapSizes.width;
//   visicomMap.height = 500;
//   visicomMap.src = visicomMapSrc;
// }
// outputsize();

// const observer = new ResizeObserver(outputsize).observe(
//   document.getElementById("wrapper")
// );
