const occasion = {
    clarification: `Зміна площі відбулася в результаті перерахунку площ після уточнення лінійних розмірів. Згідно до «Інструкції про порядок проведення технічної інвентаризації об’єктів нерухомого майна» від 24.05.2001 р. №127 (у редакції наказу Міністерства регіонального розвитку, будівництва та житлово-комунального господарства України від 26.07.2018 р. №186), зареєстровано в Міністерстві юстиції України 20 грудня 2018 р. за № 1442/32894, р.VI п.1 "Під час підрахунків слід користуватися величинами, визначеними у процесі безпосередніх обмірів, підрахунки виконувати з точністю до одного десяткового знака."; р.VI п.4 "Площа приміщень будинків визначається за їх розмірами, вимірюваними між опорядженими поверхнями стін і перегородок на рівні 1,10 м - 1,30 м від підлоги (без урахування плінтусів)."`,

    glazing: `Зміна площі відбулася в результаті засклення балкону. Згідно до «Інструкції про порядок проведення технічної інвентаризації об’єктів нерухомого майна» від 24.05.2001 р. №127 (у редакції наказу Міністерства регіонального розвитку, будівництва та житлово-комунального господарства України від 26.07.2018 р. №186), зареєстровано в Міністерстві юстиції України 20 грудня 2018 р. за № 1442/32894, р.VI п.25. Загальна площа квартир, будинку квартирного типу та гуртожитків визначається як сума площ приміщень, а також площ балконів і лоджій із такими знижувальними коефіцієнтами: 1) для балконів і терас - 0,3; 2) для лоджій - 0,5; 3) для засклених балконів - 0,8; 4) для веранд, засклених лоджій і холодних комор - 1,0.`,

    postanova406: `Зміна загальної площі відбулася за рахунок демонтування перегородок.  Згідно до Постанови КМУ від 7 червня 2017 р. № 406 "Про затвердження переліку будівельних робіт, які не потребують документів, що дають право на їх виконання, та після закінчення яких об’єкт не підлягає прийняттю в експлуатацію",  п. 1 "Роботи з переобладнання та перепланування жилого будинку і жилого приміщення, а також нежилого будинку, будівлі, споруди, приміщення в них, виконання яких не передбачає втручання в огороджувальні та несучі конструкції та/або інженерні системи загального користування, - щодо об’єктів, що за класом наслідків (відповідальності) належать до об’єктів з незначними (СС1), з середніми (СС2) та значними (СС3) наслідками."`,

    clarification_glazing: `Зміна площі відбулася в результаті перерахунку площ після уточнення лінійних розмірів та засклення балкону. Згідно до «Інструкції про порядок проведення технічної інвентаризації об’єктів нерухомого майна» від 24.05.2001 р. №127 (у редакції наказу Міністерства регіонального розвитку, будівництва та житлово-комунального господарства України від 26.07.2018 р. №186), зареєстровано в Міністерстві юстиції України 20 грудня 2018 р. за № 1442/32894, р.VI п.1 "Під час підрахунків слід користуватися величинами, визначеними у процесі безпосередніх обмірів, підрахунки виконувати з точністю до одного десяткового знака."; р.VI п.4 "Площа приміщень будинків визначається за їх розмірами, вимірюваними між опорядженими поверхнями стін і перегородок на рівні 1,10 м - 1,30 м від підлоги (без урахування плінтусів). Та р.VI п.25. Загальна площа квартир, будинку квартирного типу та гуртожитків визначається як сума площ приміщень, а також площ балконів і лоджій із такими знижувальними коефіцієнтами: 1) для балконів і терас - 0,3; 2) для лоджій - 0,5; 3) для засклених балконів - 0,8; 4) для веранд, засклених лоджій і холодних комор - 1,0."`,

}

const textarea = document.getElementById('textarea');
const clarification = document.getElementById('clarification');
const glazing = document.getElementById('glazing');
const switches = document.querySelectorAll('.form-check-input');
const state = { condition: [], textarea: [] };

function handleSwitch() {
    switches.forEach(el => {
        state.condition.push({ id: el.id, status: el.hasAttribute('checked') });
    });
};
handleSwitch();

switches.forEach(el => {

    el.addEventListener('change', (e) => {
        let id = e.target.id;
        let find = state.condition.filter(el => el.id === id);
        let status = find.length > 0 ? find[0].status : [];

        if (status === false) {
            find[0].status = true;
            state.textarea.push(id);
            handleTextAreaValue(state.textarea);
        }
        if (status === true) {
            find[0].status = false;
            state.textarea.splice(id, 1);
            handleTextAreaValue(state.textarea);
        }
    });

});

function handleTextAreaValue(arr) {
    if (arr.filter(el => el === 'clarification').length === 1) {
        textarea.value = occasion['clarification'];
    }
    if (arr.filter(el => el === 'glazing').length === 1) {
        textarea.value = occasion['glazing'];
    }
    if (arr.filter(el => el === 'postanova406').length === 1) {
        textarea.value = occasion['postanova406'];
    }
    if (arr.filter(el => el === 'clarification').length === 1
        && arr.filter(el => el === 'glazing').length === 1) {
        textarea.value = occasion['clarification_glazing'];
    }
    if (arr.length === 0) {
        textarea.value = '';
        state.textarea = [];
    }
}

document.getElementById('btn').addEventListener('click', () => {
    console.log(state.textarea);
})


