const occasion = [
    {
        id: "clarification",
        text: `Зміна площі відбулася в результаті перерахунку площ після уточнення лінійних розмірів. Згідно до «Інструкції про порядок проведення технічної інвентаризації об’єктів нерухомого майна» від 24.05.2001 р. №127 (у редакції наказу Міністерства регіонального розвитку, будівництва та житлово-комунального господарства України від 26.07.2018 р. №186), зареєстровано в Міністерстві юстиції України 20 грудня 2018 р. за № 1442/32894, р.VI п.1 "Під час підрахунків слід користуватися величинами, визначеними у процесі безпосередніх обмірів, підрахунки виконувати з точністю до одного десяткового знака."; р.VI п.4 "Площа приміщень будинків визначається за їх розмірами, вимірюваними між опорядженими поверхнями стін і перегородок на рівні 1,10 м - 1,30 м від підлоги (без урахування плінтусів)."`
    },

    {
        id: "glazing",
        text: `Зміна площі відбулася в результаті засклення балкону. Згідно до «Інструкції про порядок проведення технічної інвентаризації об’єктів нерухомого майна» від 24.05.2001 р. №127 (у редакції наказу Міністерства регіонального розвитку, будівництва та житлово-комунального господарства України від 26.07.2018 р. №186), зареєстровано в Міністерстві юстиції України 20 грудня 2018 р. за № 1442/32894, р.VI п.25. Загальна площа квартир, будинку квартирного типу та гуртожитків визначається як сума площ приміщень, а також площ балконів і лоджій із такими знижувальними коефіцієнтами: 1) для балконів і терас - 0,3; 2) для лоджій - 0,5; 3) для засклених балконів - 0,8; 4) для веранд, засклених лоджій і холодних комор - 1,0.`
    },

    {
        id: "postanova406",
        text: `Зміна загальної площі відбулася за рахунок демонтування перегородок.  Згідно до Постанови КМУ від 7 червня 2017 р. № 406 "Про затвердження переліку будівельних робіт, які не потребують документів, що дають право на їх виконання, та після закінчення яких об’єкт не підлягає прийняттю в експлуатацію",  п. 1 "Роботи з переобладнання та перепланування жилого будинку і жилого приміщення, а також нежилого будинку, будівлі, споруди, приміщення в них, виконання яких не передбачає втручання в огороджувальні та несучі конструкції та/або інженерні системи загального користування, - щодо об’єктів, що за класом наслідків (відповідальності) належать до об’єктів з незначними (СС1), з середніми (СС2) та значними (СС3) наслідками."`
    },
    {
        id: "clarification_glazing",
        text: `Зміна площі відбулася в результаті перерахунку площ після уточнення лінійних розмірів та засклення балкону. Згідно до «Інструкції про порядок проведення технічної інвентаризації об’єктів нерухомого майна» від 24.05.2001 р. №127 (у редакції наказу Міністерства регіонального розвитку, будівництва та житлово-комунального господарства України від 26.07.2018 р. №186), зареєстровано в Міністерстві юстиції України 20 грудня 2018 р. за № 1442/32894, р.VI п.1 "Під час підрахунків слід користуватися величинами, визначеними у процесі безпосередніх обмірів, підрахунки виконувати з точністю до одного десяткового знака."; р.VI п.4 "Площа приміщень будинків визначається за їх розмірами, вимірюваними між опорядженими поверхнями стін і перегородок на рівні 1,10 м - 1,30 м від підлоги (без урахування плінтусів). Та р.VI п.25. Загальна площа квартир, будинку квартирного типу та гуртожитків визначається як сума площ приміщень, а також площ балконів і лоджій із такими знижувальними коефіцієнтами: 1) для балконів і терас - 0,3; 2) для лоджій - 0,5; 3) для засклених балконів - 0,8; 4) для веранд, засклених лоджій і холодних комор - 1,0."`
    },
    {
        id: "without_balkon_1",
        text: `Повідомляємо, що при оформленні договору міни квартири технічна інвентаризація не проводилась та до загальної площі квартири помилково не включена площа існуючого балкону. Загальна площа з урахуванням 80% площі балкону становить {{ЗАГАЛЬНА ПЛОЩА}} кв.м.`
    },
    {
        id: "without_balkon_2",
        text: `Виявлено що при оформленні правовстановлюючих документів не враховано 30% площі балкону. Згідно до «Інструкції про порядок проведення технічної інвентаризації об’єктів нерухомого майна» від 24.05.2001 р. №127 (у редакції наказу Міністерства регіонального розвитку, будівництва та житлово-комунального господарства України від 26.07.2018 р. №186), зареєстровано в Міністерстві юстиції України 20 грудня 2018 р. за №1442/32894, загальна площа квартир, будинку квартирного типу та гуртожитків визначається як сума площ приміщень, а також площ балконів і лоджій із такими знижувальними коефіцієнтами: 1) для балконів - 0,3; 2) для лоджій - 0,5; 3) для засклених балконів - 0,8; 4) для веранд, засклених лоджій і холодних комор - 1,0.`
    },
    {
        id: "zmina_za_rahunok_vkluchennya_zabudovi",
        text: `Зміна площ відбулась за рахунок того, що при оформленні ПРАВОГО ДОКУМЕНТУ до загальної площі внесено площу забудови`
    },
    {
        id: "pereliteraciya_budivel",
        text: `Згідно з даними Свідоцтва про право власності на нерухоме майно, від 05.03.2008 р., літерація будівель та споруд складає:

- житловий будинок, літ. «А1»
- веранда, літ. «а»
- веранда, літ. «а1»

Згідно з даними технічної інвентарізації 21 вересня 2021 р. літерація будинку операторів та господарських будівель розташованих за адресою: Хмельницька обл., Хмельницький р-н., с. Щиборівканка, вулиця Стара, б. 12, складає: 

- житловий будинок, літ. «А-1»
- веранда, літ. «а1»
- веранда, літ. «а2»

Згідно до «Інструкції про порядок проведення технічної інвентаризації об’єктів нерухомого майна» від 24.05.2001 р. №127 (у редакції наказу Міністерства регіонального розвитку, будівництва та житлово-комунального господарства України від 26.07.2018 р. №186), зареєстровано в Міністерстві юстиції України 20 грудня 2018 р. за №1442/32894, кожен будинок та господарська будівля, починаючи з основної, літерується великими літерами алфавіту. Наприклад, "А" - житловий будинок; "Б"; "В" - господарські будівлі. Основна частина житлові прибудови (кімнати) - великими літерами з відповідним цифровим позначенням, наприклад А1, А2. Прибудови допоміжного призначення до будинку та прибудови до допоміжних (господарських) будівель - малими літерами з відповідним цифровим позначенням, наприклад "а3", "а4", "а5", "а6",  при цьому цифрове позначення не повторюється.`
    },
]

const textarea = document.getElementById('textarea');
const radios = document.querySelectorAll('.btn-check');
const state = { condition: [], textarea: [] };

// (function handleSwitch() {
//     switches.forEach(el => {
//         state.condition.push({ id: el.id, status: el.hasAttribute('checked') });
//     });
// }());

// // Change event for switches
// switches.forEach(el => {

//     el.addEventListener('change', (e) => {
//         let id = e.target.id;
//         let find = state.condition.filter(el => el.id === id);
//         let status = find.length > 0 ? find[0].status : [];

//         if (status === false) {
//             find[0].status = true;
//             e.target.setAttribute('checked', '');
//             state.textarea.push(id);
//             handleTextAreaValue(state.textarea);
//         }
//         if (status === true) {
//             find[0].status = false;
//             state.textarea.splice(id, 1);
//             handleTextAreaValue(state.textarea);
//         }
//     });

// });

// function removeSwitches(switches) {
//     switches.forEach(el => {
//         el.removeAttribute('checked');
//     })
// }

// function handleTextAreaValue(arr) {
//     if (arr.filter(el => el === 'clarification').length === 1) {
//         textarea.value = occasion['clarification'];
//     }
//     if (arr.filter(el => el === 'glazing').length === 1) {
//         textarea.value = occasion['glazing'];
//     }
//     if (arr.filter(el => el === 'postanova406').length === 1) {
//         removeSwitches(switches);
//         textarea.value = occasion['postanova406'];
//     }
//     if (arr.filter(el => el === 'clarification').length === 1
//         && arr.filter(el => el === 'glazing').length === 1) {
//         textarea.value = occasion['clarification_glazing'];
//     }
//     if (arr.length === 0) {
//         textarea.value = '';
//         state.textarea = [];
//     }
// }

radios.forEach(radio => {

    radio.addEventListener('change', (e) => {

        occasion.forEach(item => {
            if (e.target.id === item.id) {
                textarea.value = item.text;
            }
        });

    });

});


// Initialize toast
const toast = document.getElementById('toast');
function toastConstructor(toast, params) {
    toast.innerHTML = '';
    toast.classList = '';
    if (params.text === undefined) {
        params.text = '';
    } else {
        const body = document.createElement('div');
        if (params.type === 'success') {
            toast.classList = "toast bg-success text-light";
            body.classList = ('toast-body');
            body.innerText = params.text;
        }
        else if (params.type === 'error') {
            toast.classList = "toast bg-danger text-light";
            body.classList = ('toast-body');
            body.innerText = params.text;
        }
        else {
            toast.classList = "toast bg-primary text-light";
            body.classList = ('toast-body');
            body.innerText = params.text;
        }
        toast.appendChild(body);
    }
};

const btn = document.getElementById('btn');
if (btn) {
    document.getElementById('btn').addEventListener('click', () => {
        textarea.select();
        document.execCommand("copy");
        textarea.blur();

        toastConstructor(toast, { type: 'success', text: 'Зкопійовано!!!' }); // Setup toast
        new bootstrap.Toast(toast).show(); // Show toast
    })
}

